j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE Why shouldn't local law enforcement agencies assist ICE?
   CLOSED: [2018-06-23 Sat 10:03]
   :PROPERTIES:
   :EXPORT_FILE_NAME: assist-ice
   :EXPORT_AUTHOR: "Hawaii J20"
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question:
Why shouldn't local law enforcement agencies assist their law enforcement
colleagues at the federal Immigration and Customs Enforcement agency (ICE)?

*** Background:
Immigration enforcement is a federal function. Local law enforcement agencies
are concerned with policing our communities.  Immigration enforcement is not a
function carried out by local law enforcement agencies.

When undocumented immigrants fear that local police are acting as ICE agents who
can initiate deportation, they are reluctant to make contact with the police.
They are reluctant to report crimes and suspected crimes to the police, and they
are reluctant to come forth as witnesses to crimes.

More than [[https://en.wikipedia.org/wiki/Sanctuary_city][500 state and local governments]] across the U.S. recognize this
problem.

When members of the community are reluctant to contact the police, the police
have a more difficult time fighting crime. That makes our communities less safe
for everyone.

*** Answer:
Local law enforcement agencies *should* assist ICE as required by law. They
*should not* provide additional assistance to ICE, beyond what is required by
law, because this will interfere with their ability to police local communities.

