j20-immigration/content/post/assist-ice.md
+++
title = "Why shouldn't local law enforcement agencies assist ICE?"
author = ["Hawaii J20"]
date = 2018-06-23T10:03:00-10:00
lastmod = 2018-08-04T18:04:08-10:00
draft = false
[menu.main]
  weight = 2007
  identifier = "why-shouldn-t-local-law-enforcement-agencies-assist-ice"
+++

## Question: {#question}

Why shouldn't local law enforcement agencies assist their law enforcement
colleagues at the federal Immigration and Customs Enforcement agency (ICE)?


## Background: {#background}

Immigration enforcement is a federal function. Local law enforcement agencies
are concerned with policing our communities.  Immigration enforcement is not a
function carried out by local law enforcement agencies.

When undocumented immigrants fear that local police are acting as ICE agents who
can initiate deportation, they are reluctant to make contact with the police.
They are reluctant to report crimes and suspected crimes to the police, and they
are reluctant to come forth as witnesses to crimes.

More than [500 state and local governments](https://en.wikipedia.org/wiki/Sanctuary%5Fcity) across the U.S. recognize this
problem.

When members of the community are reluctant to contact the police, the police
have a more difficult time fighting crime. That makes our communities less safe
for everyone.


## Answer: {#answer}

Local law enforcement agencies **should** assist ICE as required by law. They
**should not** provide additional assistance to ICE, beyond what is required by
law, because this will interfere with their ability to police local communities.
